GHB2/src/Documents/гхб_ЗакреплениеПраваЗаездаНаТерриториюЛокации/гхб_ЗакреплениеПраваЗаездаНаТерриториюЛокации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_ЗакреплениеПраваЗаездаНаТерриториюЛокации</name>
  <registerRecords>InformationRegister.гхб_ПраваЗаездаНаТерриториюЛокации</registerRecords>
  <attributes>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникиКраткийСостав</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
        <types>CatalogRef.гхб_ПрочиеФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньДолжности</name>
      <type>
        <types>EnumRef.гхб_УровниДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипАвтомобиля</name>
      <type>
        <types>EnumRef.гхб_ТипАвтомобиляСлужебныйПерсональный</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.гхб_Автомобили</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПропуска</name>
      <type>
        <types>EnumRef.гхб_ВидПропускаПарковочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОперации</name>
      <type>
        <types>EnumRef.гхб_ТипОперацииЗакреплениеОткреплениеПарковочногоМеста</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_ПраваЗаездаНаТерриториюЛокации/гхб_ПраваЗаездаНаТерриториюЛокации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ПраваЗаездаНаТерриториюЛокации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ВидПропуска</name>
    <type>
      <types>EnumRef.гхб_ВидПропускаПарковочныеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.гхб_ТипОперацииЗакреплениеОткреплениеПарковочногоМеста</types>
    </type>
  </attributes>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФИО</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
      <types>CatalogRef.гхб_ПрочиеФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.гхб_Автомобили</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_РаботникиОрганизацийБазХолдинга/гхб_РаботникиОрганизацийБазХолдинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РаботникиОрганизацийБазХолдинга</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.гхб_ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.гхб_ДолжностиОрганизацийБазХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>ПозицияШтатногоРасписания</name>
    <type>
      <types>CatalogRef.гхб_ПозицииШтатногоРасписанияБазХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияСрочногоТрудовогоДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.гхб_ЦФО</types>
    </type>
  </resources>
  <attributes>
    <name>Дивизион</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </attributes>
  <attributes>
    <name>БюджетныйКодПозиции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДивизиона</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_СотрудникиБазХолдинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ШтатноеРасписаниеБазХолдинга/гхб_ШтатноеРасписаниеБазХолдинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ШтатноеРасписаниеБазХолдинга</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КритичнаяПозиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БюджетныйКодПозиции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>БюджетныйКодПозицииРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньДолжности</name>
    <type>
      <types>EnumRef.гхб_УровниДолжностей</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакПозиции</name>
    <type>
      <types>EnumRef.гхб_ПризнакиПозиций</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.гхб_ПозицииШтатногоРасписанияБазХолдинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест/гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ИспользоватьДляЗакрепленияПарковочныхМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_НастройкиВозможностейЗакрепленияПарковочныхМест/гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_НастройкиВозможностейЗакрепленияПарковочныхМест</name>
  <attributes>
    <name>РедактированиеДокументаЗакрепления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоОбУвольненииСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоОПрекращенииДействияПропуска</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_РуководителиЛокаций/гхб_РуководителиЛокаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РуководителиЛокаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ПричиныИзмененияСостояния/гхб_ПричиныИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ПричиныИзмененияСостояния</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПриемНаРаботу</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Декрет</name>
    <comment>Декрет</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратИзДекрет</name>
    <comment>Возврат из декрет</comment>
  </enumValues>
</mdclass:Enum>

GHB2/src/Enums/гхб_ВидыЗанятостиВОрганизации/гхб_ВидыЗанятостиВОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ВидыЗанятостиВОрганизации</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Enums/гхб_ТипОперацииЗакреплениеОткреплениеПарковочногоМеста/гхб_ТипОперацииЗакреплениеОткреплениеПарковочногоМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипОперацииЗакреплениеОткреплениеПарковочногоМеста</name>
  <enumValues>
    <name>Закрепление</name>
  </enumValues>
  <enumValues>
    <name>Открепление</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Documents/гхб_ЗакреплениеПраваЗаездаНаТерриториюЛокации/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ДанныеФИОПриИзменении(Элемент)
	
	ТД = Элементы.Данные.ТекущиеДанные;
	
	Если НЕ (ТД = Неопределено) И ЗначениеЗаполнено(ТД.ФИО) Тогда
		ТД.УровеньДолжности = ПолучитьУровеньДолжностиПоОсновномуМестуРаботы(ТД.ФИО);
		Элементы.ДанныеАвтомобиль.СписокВыбора.ЗагрузитьЗначения(ВернутьАвтомобилиДляСотрудника(ТД.ФИО));
	Иначе
		Элементы.ДанныеАвтомобиль.СписокВыбора.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьАвтомобилиДляСотрудника(_ФЛ)

	Возврат РегистрыСведений.гхб_ПраваЗаездаНаТерриториюЛокации.ВернутьДоступныеАвтомобилиДляСотрудника(_ФЛ)
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУровеньДолжностиПоОсновномуМестуРаботы(_ФЛ)
	
	_УровеньДолжности = Перечисления.гхб_УровниДолжностей.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(_ФЛ) Тогда
		
		ЗапросКадры = Новый Запрос();
		ЗапросКадры.Текст = "ВЫБРАТЬ
		                    |	гхб_ШтатноеРасписаниеБазХолдингаСрезПоследних.УровеньДолжности КАК УровеньДолжности
		                    |ИЗ
		                    |	РегистрСведений.гхб_РаботникиОрганизацийБазХолдинга.СрезПоследних(, Сотрудник.ФизЛицоБазыХолдинга.ФизЛицоТекущейБазы = &ФизЛицоТекущейБазы) КАК гхб_РаботникиОрганизацийБазХолдингаСрезПоследних
		                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гхб_ШтатноеРасписаниеБазХолдинга.СрезПоследних КАК гхб_ШтатноеРасписаниеБазХолдингаСрезПоследних
		                    |		ПО гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.БазаХолдинга = гхб_ШтатноеРасписаниеБазХолдингаСрезПоследних.БазаХолдинга
		                    |			И гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.Организация = гхб_ШтатноеРасписаниеБазХолдингаСрезПоследних.Организация
		                    |			И гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.ПодразделениеОрганизации = гхб_ШтатноеРасписаниеБазХолдингаСрезПоследних.ПодразделениеОрганизации
		                    |			И гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.ПозицияШтатногоРасписания = гхб_ШтатноеРасписаниеБазХолдингаСрезПоследних.Позиция
		                    |ГДЕ
		                    |	гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.гхб_ПричиныИзмененияСостояния.Увольнение)
		                    |	И гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.Сотрудник.ВидЗанятости В(&ВидЗанятости)";
		
		_СписокВидовЗанятости = Новый СписокЗначений();
		_СписокВидовЗанятости.Добавить(Перечисления.гхб_ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы);
		_СписокВидовЗанятости.Добавить(Перечисления.гхб_ВидыЗанятостиВОрганизации.Совместительство);

		ЗапросКадры.УстановитьПараметр("ВидЗанятости", _СписокВидовЗанятости);
		ЗапросКадры.УстановитьПараметр("ФизЛицоТекущейБазы", _ФЛ);
		
		Выборка = ЗапросКадры.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			_УровеньДолжности = Выборка.УровеньДолжности;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат _УровеньДолжности;
	
КонецФункции

&НаКлиенте
Процедура ДанныеАвтомобильПриИзменении(Элемент)
	
	ТД = Элементы.Данные.ТекущиеДанные;
	
	Если НЕ (ТД = Неопределено) И ЗначениеЗаполнено(ТД.Автомобиль) Тогда
		ТД.ТипАвтомобиля = ВернутьТипАвтомобиля(ТД.Автомобиль);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьТипАвтомобиля(_Автомобиль)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(_Автомобиль, "ТипАвтомобиля")
	
КонецФункции

&НаКлиенте
Процедура ДанныеТипАвтомобиляПриИзменении(Элемент)
	
	ТД = Элементы.Данные.ТекущиеДанные;
	
	Если НЕ (ТД = Неопределено) Тогда
		Если ЗначениеЗаполнено(ТД.Автомобиль) И ЗначениеЗаполнено(ТД.ТипАвтомобиля) И НЕ (ТД.ТипАвтомобиля = ВернутьТипАвтомобиля(ТД.Автомобиль)) Тогда
			ТД.Автомобиль = ПредопределенноеЗначение("Справочник.гхб_Автомобили.ПустаяСсылка");
		КонецЕсли;
		
		УстановитьПараметрыВыбораДляАвтомобиля(ТД.ТипАвтомобиля);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораДляАвтомобиля(_ТипАвтомобиля)
	
	НовыйПараметр = Новый ПараметрВыбора("ФильтрПоТипуАвтомобиля", _ТипАвтомобиля);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.ДанныеАвтомобиль.ПараметрыВыбора = НовыеПараметры;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_Массив = Новый Массив();
	
	Если РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		
		_Массив = РегистрыСведений.гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест.ВернутьДоступныеЛокацииДляПарковок();
		
	Иначе
		
		_МассивЛокацийДляПарковок = РегистрыСведений.гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест.ВернутьДоступныеЛокацииДляПарковок();

		_ФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийПользователь, "ФизическоеЛицо");
		
		_МассивДоступныхЛокаций = РегистрыСведений.гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.ВернутьДоступныеЛокацииСотрудникаДляРедактированияДокумента(_ФЛ);
		
		Для Каждого Стр Из _МассивДоступныхЛокаций Цикл
			Если НЕ (_МассивЛокацийДляПарковок.Найти(Стр) = Неопределено) Тогда
				_Массив.Добавить(Стр);
			КонецЕсли;
		КонецЦикла;
		
		_МассивДоступныхЛокаций = РегистрыСведений.гхб_РуководителиЛокаций.ВернутьЛокацииПоРуководителю(_ФЛ);
		
		Для Каждого Стр Из _МассивДоступныхЛокаций Цикл
			Если (_Массив.Найти(Стр) = Неопределено) И НЕ (_МассивЛокацийДляПарковок.Найти(Стр) = Неопределено) Тогда
				_Массив.Добавить(Стр);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И (_Массив.Найти(Объект.Локация) = Неопределено) Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	Иначе 	
		Элементы.Локация.СписокВыбора.ЗагрузитьЗначения(_Массив);
		Элементы.Локация.СписокВыбора.СортироватьПоЗначению();
		Элементы.Локация.РежимВыбораИзСписка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.Данные.ТекущиеДанные;
	
	Если НЕ (ТД = Неопределено) Тогда
		
		УстановитьПараметрыВыбораДляАвтомобиля(ТД.ТипАвтомобиля);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
	
		ТД = Элементы.Данные.ТекущиеДанные;
		
		Если НЕ ЗначениеЗаполнено(ТД.ТипОперации) Тогда
			ТД.ТипОперации = ПредопределенноеЗначение("Перечисление.гхб_ТипОперацииЗакреплениеОткреплениеПарковочногоМеста.Закрепление");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
